trade_exp/src/DataProcessors/Самообслуживание/Самообслуживание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Самообслуживание</name>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/УчетРабочегоВремениСотрудников/УчетРабочегоВремениСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="13d75dc0-9223-4b1b-beb4-cba8132abe50">
  <name>УчетРабочегоВремениСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="a44913b0-4063-4968-bf34-b77f64254b83">
    <name>Событие</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="54b7c3ee-5669-4057-b209-a361d67c8bad">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0d926621-4d7d-40ed-8fec-80d57c83437a">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="58649832-c538-4ecf-98e0-7df52cfc2105">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СостоянияСотрудников/СостоянияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5c9d146-8f4a-45db-9b47-dc1f6c9559b2">
  <name>СостоянияСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b343c276-8ae6-43f0-b8dc-6404f67693a2">
    <name>Зашел</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="33217620-5c33-4012-bc80-e5f910792d19">
    <name>Вышел</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/DataProcessors/Самообслуживание/Forms/ФормаРегистрацияСотрудников/Module.bsl
#Область События

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	ПодключитьОбработчикОжидания("ЗакрытиеФормыПоВремени", 60, Ложь);
КонецПроцедуры     

&НаКлиенте
Процедура ЗакрытиеФормыПоВремени()  
	Закрыть();
КонецПроцедуры	

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
КонецПроцедуры

//ОПОВЕЩЕНИЕ
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ОчиститьСообщения();
	ВремяПоказа= 5;
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			
			ДанныеШтрихкодов = ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			
			СтруктураДанных= ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			Штрихкод= СокрЛП(СтруктураДанных.Штрихкод);
			
			// СКАНИРОВАНИЕ ВОДИТЕЛЯ
			Если Лев(Штрихкод, 4) = "8888" Тогда//1. Водитель
				Сотрудник = РСС_УправлениеОчередьюИСборкойЗаказов.ПоискСотрудникаПоШтрихкоду(Штрихкод);
				Если ЗначениеЗаполнено(Сотрудник) Тогда
					НадписьСотрудник= Сотрудник;
					Если Не АльтерраОбщегоНазначения.ЭтоВодитель(Сотрудник) Тогда
						// ВХОД ВЫХОД СОТРУДНИКА
						РезРегистрации= ЗрегестрироватьСотрудникаПоШтрихкодуСервер(Сотрудник);
						ПоказатьПредупреждение(, РезРегистрации, 2, "Сканирование сотрудников");
						ПодключитьОбработчикОжидания("ЗакрытиеФормыПослеСканирования", 10, Ложь);
						Возврат;
					КонецЕсли
				КонецЕсли
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область РегистрацияСотрудников

&НаСервере
Функция ЗрегестрироватьСотрудникаПоШтрихкодуСервер(Сотрудник)
	УстановитьПривилегированныйРежим(Истина);
	Ошибка= Ложь;
	Событие= Перечисления.СостоянияСотрудников.Вышел;
	
	Результат= АльтерраОбщегоНазначения.СотрудникВОфисе(Сотрудник);
	
	ПредыдущееСостояние= Результат.Состояние;
	ПериодПредудущегоСобытия= Результат.Период;
	
	//Проверяем двойное сканирование
	Если (ПериодПредудущегоСобытия+5*1) >= ТекущаяДата() Тогда
		Ошибка= Истина;
		Событие= ПредыдущееСостояние;
		Возврат "Между последним сконированием прошло меньше 5 секунд!";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		НадписьСотрудник= Сотрудник.Наименование+", "+Сотрудник.Должность;
		
		Если Сотрудник.Уволен Или Сотрудник.ПометкаУдаления Тогда
			Возврат "Сотрудник уволен!";
		Иначе
			НаборЗаписей= РегистрыСведений.УчетРабочегоВремениСотрудников.СоздатьНаборЗаписей();
			НоваяЗапись= НаборЗаписей.Добавить();
			НоваяЗапись.Период= ТекущаяДата();
			НоваяЗапись.Сотрудник= Сотрудник;
			НоваяЗапись.Пользователь= Сотрудник.Пользователь;
			НоваяЗапись.Подразделение= ?(ЗначениеЗаполнено(Сотрудник.Подразделение), Сотрудник.Подразделение, Сотрудник.Пользователь.ТекущееПодразделение);
			
			//Если последнее событие было вчера или позднее тогда всегда зашел
			Если НачалоДня(ПериодПредудущегоСобытия) < НачалоДня(ТекущаяДата()) Тогда
				НоваяЗапись.Событие= Перечисления.СостоянияСотрудников.Зашел;
			Иначе
				// Общая проверка
				Если  ПредыдущееСостояние = Перечисления.СостоянияСотрудников.Вышел Тогда//Вышел или ещё не было
					НоваяЗапись.Событие= Перечисления.СостоянияСотрудников.Зашел;
				Иначе
					НоваяЗапись.Событие= Перечисления.СостоянияСотрудников.Вышел;
				КонецЕсли;
			КонецЕсли;
			Событие= НоваяЗапись.Событие;
			
			НаборЗаписей.Записать(Ложь);
			Возврат "Сотрудник "+НоваяЗапись.Событие;
		КонецЕсли;
	Иначе 
		Ошибка= Истина;
		Возврат "Сотрудник не найден!";
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции

&НаКлиенте
Процедура ЗакрытиеФормыПослеСканирования() Экспорт
 Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура Меню(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти
